
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Продажи") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Салоны = ДанныеЗаполнения.Салоны;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Запись = ДанныеЗаполнения.Ссылка;
		Сумма = ДанныеЗаполнения.Сумма;
		Услуга = ДанныеЗаполнения.Услуга;
		Продажа = ДанныеЗаполнения.Ссылка; 
		Запись = ДанныеЗаполнения.Запись;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Деньги Приход
	Движения.Деньги.Записывать = Истина;
	Движение = Движения.Деньги.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;        
	
	Движение.ТипДенежныхСредств = ТипДенежныхСредствПоСпособуОплату(СпособОплаты);
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Функция ТипДенежныхСредствПоСпособуОплату(СпособОплаты)
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.СпособОплаты.Наличные,Перечисления.ТипДенежныхСредств.Наличные);
	Соответствие.Вставить(Перечисления.СпособОплаты.Карта,Перечисления.ТипДенежныхСредств.Безналичные);
	
	
	Возврат Соответствие[СпособОплаты];
	

КонецФункции // ()
