
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Записи") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Салоны = ДанныеЗаполнения.Салоны;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Сумма = ДанныеЗаполнения.Сумма;
		Услуга = ДанныеЗаполнения.Услуга; 
		Запись = ДанныеЗаполнения.Ссылка;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.Салон = Салоны;
	Движение.Клиент = Клиент;
	Движение.Сотрудник = Сотрудник;
	Движение.Услуга = Услуга;
	Движение.Сумма = Сумма;         

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроцентыПоЗарплате.Процент КАК Процент
		|ИЗ
		|	РегистрСведений.ПроцентыПоЗарплате КАК ПроцентыПоЗарплате
		|ГДЕ
		|	ПроцентыПоЗарплате.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Процент = 0;
	РезультатЗапроса = Запрос.Выполнить();  
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Процент = Выборка.Процент;		
		
	КонецЕсли;

	Движения.Зарплата.Записывать=Истина;
	Движение = Движения.Зарплата.Добавить();
	Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
	Движение.Салон = Салоны;
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Месяц = НачалоМесяца(Дата);
	Движение.Сумма = Сумма*Процент/100;

КонецПроцедуры
