
&НаКлиенте
Процедура Подбор(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаСписка",,ВладелецФормы,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Для каждого НоменклатураПодбора из ПараметрыПеретаскивания.Значение Цикл 
		СтруктураОтбора = Новый Структура("Номенклатура", НоменклатураПодбора);
	 	НайденныеСтроки = Объект.СписокНоменклатуры.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество()=0  Тогда
			НоваяСтрока =Объект.СписокНоменклатуры.Добавить();
			НоваяСтрока.Номенклатура = НоменклатураПодбора; 
			НоваяСтрока.Количество = 1;
		Иначе
			ПерваяСтрока = НайденныеСтроки[0];
			ПерваяСтрока.Количество = ПерваяСтрока.Количество + 1;
		КонецЕсли;
		
	
	КонецЦикла;
	
	
КонецПроцедуры
